Repository: AlbanDAVID/cooky-app
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Add delightful recipe
fr: Ajouter une recette

source: Add from web
fr: Depuis le web

# messageDialBoxAddFromWeb
source: Should work on marmiton.org, cuisineaz.com Will retireve : recipe name, ingredients ans steps
fr: Devrait fonctionner avec marmiton.org, cuisineaz.com Le nom de la recette, les étapes et les ingrédients vont être récupérés

# pastUrl
source: Paste URL here
fr: Coller l'URL ici

# add
source: Submit
fr: Valider

source: (beta)
fr: (bêta)

source: Create
fr: Créer

source: Back
fr: Retour

# addCategory
source: Add a category
fr: Ajouter une catégorie

source: Are you sure ?
fr: Êtes-vous sûr ?

# confirmLongPress1
source: Confirm the desired option with a long press
fr: Faire un appui prolongé sur le choix désiré

source: Delete all recipes
fr: Supprimer toutes les recettes

source: Delete all recipes and categories
fr: Supprimer toutes les recettes et catégories

# actionAfterLongPress1
source: Yes, I want to delete this category and their recipes
fr: Oui, je veux supprimer cette catégorie ainsi que les recettes qu'elle contient

source: Delete all
fr: Tout supprimer

source: Edit/Delete
fr: Éditer/Supprimer

source: Edit category
fr: Éditer la catégorie

# infoMessage1
source: All recipes inside this category will get the new category name
fr: Toutes les recettes de cette catégorie recevront le nouveau nom de catégorie

source: Edit
fr: Éditer

# confirmLongPress2
source: Yes, I want to delete this recipe
fr: Oui, je souhaite supprimer cette recette

# confirmLongPress3
source: Yes, I want to delete all recipes of this category
fr: Oui, je souhaite supprimer toutes les recettes de cette catégorie

# confirmLongPress4
source: Confirm the deletion with a long press
fr: Confirmez la suppression avec un appui prolongé

source: Add category (required)
fr: Ajouter une catégorie (requis)

source: Add recipe name
fr: Ajouter le nom de la recette

source: Recipe name:
fr: Nom de la recette :

source: Category:
fr: Categorie :

source: Add total time
fr: Ajouter le temps total

source: Total time:
fr: Temps total :

source: Deleted
fr: Supprimé

source: Add difficulty
fr: Ajouter la difficulté

source: Difficulty:
fr: Difficulté :

source: Add cost
fr: Ajouter le coût

source: Cost:
fr: Coût :

source: Close
fr: Fermer

source: Add picture
fr: Ajouter une photo

# noPic
source: No photo selected
fr: Aucune photo sélectionnée

# chooseGallery
source: Choose from gallery
fr: Ouvrir la galerie

# takePic
source: Take a picture
fr: Prendre une photo

# addPicture2
source: Add the picture
fr: Ajouter la photo

source: Picture :
fr: Photo :

source: Preview picture
fr: Aperçu photo

# addIngred
source: Add ingredients
fr: Ajouter les ingrédients

# addIngred2
source: Add an ingredient
fr: Ajouter un ingredient

# ingredName
source: Ingredient name
fr: Nom de l'ingrédient

source: Quantity
fr: Quantité

source: Unit
fr: Unité

source: Collapse
fr: Cacher

# showIngred
source: Show Ingredients
fr: Montrer les ingrédients

source: Add steps
fr: Ajouter les étapes

source: Steps
fr: Étapes

# stepCasLock
source: STEP
fr: ÉTAPE

# addNewStep
source: Add a new step
fr: Ajouter une nouvelle étape

source: Cancel
fr: Annuler

# writeStep
source: Write the step here
fr: Écrire l'étape ici

source: Step
fr: Étape

source: Show steps
fr: Montrer les étapes

source: Add tags
fr: Ajouter des mots-clés

# writeTag
source: Write a tag here
fr: Saisir un mot-clé ici

# addTag
source: Add a tag
fr: Ajouter un mot-clé

source: Show tags
fr: Montrer les tags

# confirmExit
source: Yes, exit
fr: Oui, quitter

source: No
fr: Non

# areYouSureExit
source: Are you sure you want to exit?
fr: Êtes-vous sûr de vouloir quitter ?

# saveEditLater
source: You can save changes and edit later
fr: Vous pouvez valider la recette et éditer plus tard

# createRecipe
source: Create a recipe
fr: Créer une recette

source: Edit recipe
fr: Éditer la recette

source: Save changes
fr: Sauvegarder les changements

source: Start to cook!
fr: Cuisiner !

# showSuggestion
source: Show suggestions
fr: Afficher les suggestions

# listTags
source: Appetizer,Healthy,Starter,Main Course,Dessert,Vegetarian,Vegan,Gluten-Free,Easy,Quick,Indulgent,Spicy,Sweet,Savory,Balanced,Traditional,Fusion,Exotic,Comfort Food,Light,Grilled,Baked,Fish,Meat,Chicken,Beef,Pork,Vegetables,Pasta,Rice,Soup,Salad,Sandwich,Breakfast,Brunch,Dinner,Party,Family Meal,Friends Gathering,Picnic
fr: Entrée,Santé, Healthy, Plat principal,Dessert,Végétarien,Végétalien,Sans gluten,Facile,Rapide,Sain,Épicé,Sucré,Savoureux,Équilibré,Traditionnel,Fusion,Exotique,Comfort Food,Léger,Grillé,Au four,Poisson,Viande,Poulet,Bœuf,Porc,Légumes,Pâtes,Riz,Soupe,Salade,Sandwich,Petit déjeuner,Brunch,Dîner,Fête,Repas en famille,Entre amis,Pique-nique

# listCommonDishes
source: Ratatouille,Beef Bourguignon,Blanquette de Veau,Cassoulet,Coq au Vin,Bouillabaisse,Duck Confit,Moules Marinières,Gratin Dauphinois,Quiche Lorraine,Raclette,Pot-au-Feu,Beef Daube,Crepes,French Onion Soup,Tarte Tatin,Cheese Soufflé,Casseroles,Beef Stroganoff,Roast Chicken,Gratin Potatoes,Lasagna,Sushi,Chicken Tikka Masala,Pad Thai,Tacos,Pizza,Spaghetti Bolognese,Biryani,Chicken Tajine,Paella,Burger,Grilled Salmon,Tom Yum Soup,Fondue,Sandwich,Chicken Caesar Salad,Sushi Bowl,Omelette,Niçoise Salad,Gyudon,Breton Galette,Carbonara,Lemon Tart,Chili Con Carne,Chicken Katsu,Chicken Curry,Spaghetti Aglio e Olio,Ramen Soup,Lok Lak Beef,Banh Mi,Apple Pie,Strawberry Pie
fr: Ratatouille,Boeuf Bourguignon,Blanquette de Veau,Cassoulet,Coq au Vin,Bouillabaisse,Confit de Canard,Moules Marinières,Gratin Dauphinois,Quiche Lorraine,Raclette,Pot-au-Feu,Bouef en Daube,Crêpes,Soupe à l'Oignon,Tarte Tatin,Soufflé au Fromage,Casseroles,Bœuf Stroganoff,Poulet Rôti,Gratin de Pommes de Terre,Lasagnes,Sushis,Poulet Tikka Masala,Pad Thaï,Tacos,Pizza,Pâtes à la Bolognaise,Biryani,Tajine de Poulet,Paella,Burger,Saumon Grillé,Soupe Tom Yum,Fondue Savoyarde,Sandwich au Poulet,Salade César,Sushi Bowl,Omelette,Salade Niçoise,Gyudon,Galette Bretonne,Carbonara,Tarte au Citron,Chili Con Carne,Poulet Katsu,Curry de Poulet,Spaghetti Aglio e Olio,Soupe Ramen,Bœuf Lok Lak,Banh Mi,Tarte aux Pommes,Tarte aux Fraises

# listCommonIngredients
source: Butter, Sugar, Flour, Milk, Egg(s), Garlic, Onion(s), Shallot(s), Parsley, Thyme, Rosemary, Basil, Oregano, Salt, Pepper, Olive Oil, Cheese, Rice, Potato(es), Carrot(s), Mushroom(s), Tomato(es), Spinach, Zucchini, Eggplant, Chicken, Beef, Pork, Fish, Shrimp, Honey, Soy Sauce, Mustard, Balsamic Vinegar, Lemon, Lemon Juice, Chocolate, Walnut(s), Almond(s), Cinnamon, Ginger, Nutmeg, Clove(s), Vanilla, Tomato Sauce, Mayonnaise, Ketchup, Tomato Paste, Chili Powder, Cumin, Curry, Paprika
fr: Beurre, Sucre, Farine, Lait, Œuf(s), Ail, Oignon(s), Échalote(s), Persil, Thym, Romarin, Basilic, Origan, Sel, Poivre, Huile d'Olive, Fromage, Riz, Pomme(s) de Terre, Carotte(s), Champignon(s), Tomate(s), Épinard, Courgette(s), Aubergine, Poulet, Bœuf, Porc, Poisson, Crevette(s), Miel, Sauce Soja, Moutarde, Vinaigre Balsamique, Lemon, Jus de Citron, Chocolat, Noix, Amande(s), Cannelle, Gingembre, Muscade, Clou de Girofle(s), Vanille, Sauce Tomate, Mayonnaise, Ketchup, Concentré de Tomate, Chili en Poudre, Cumin, Curry, Paprika

# listDifficulty
source: Easy,Medium,Hard
fr: Facile,Moyen,Difficile

# listCost
source: Budget-friendly,Average,Expensive
fr: Bon marché,Moyen,Couteux

source: Clear
fr: Effacer

# listUnits
source: g, kg, mg, ml, l, cl, tsp, tbsp, pinch, drop, piece, tbspoz, pound, cup, pt, qt, gal
fr: g, kg, mg, ml, l, cl, cc à café, cc à soupe, tasse(s), pincée(s), goutte(s), morceau(x)

source: Language
fr: Langue

# supportedLanguage
source: English,French,Your device language (english and french available)
fr: Anglais,Français,Langue de votre appareil (anglais et français supportés)

# askRestart
source: Please restart your application
fr: Merci de redémarrer votre application

source: About
fr: À-propos

# licence
source: License
fr: Licence

source: Source code
fr: Code source

# searchTag
source: Search a tag
fr: Chercher un mot-clé

# searchIngred
source: Search an ingredient
fr: Chercher un ingrédient

# searchRecipeName
source: Search a recipe name
fr: Chercher un nom de recette

source: Recipes
fr: Recettes

# searchRecipe
source: Search a recipe
fr: Chercher une recette

source: Delete
fr: Supprimer

source: Home
fr: Accueil

# quitAppConfirm
source: Quit the app?
fr: Quitter l'application ?

# errorScrap
source: Error : this URL is not supported
fr: Erreur : cette URL n'est pas supportée

# noRecipes
source: No recipes to display.
fr: Aucune recette à afficher.

# categoryEmpty
source: Category is required.
fr: Merci de renseigner une catégorie.

source: No title
fr: Sans titre

# thxContrib
source: Contributors and thanks
fr: Contributeurs et remerciements

# dougy147
source: A big thank to dougy147 for his marmiteur library allowing us to retrieve our favorite recipes from the internet!
fr: Un grand merci à dougy147 pour sa librairie marmiteur permettant d'aller récupérer nos recettes favorites sur internet !

# feelFreeContrib
source: Don't hesitate to improve this app with your contribution!
fr: N'hésitez pas à apporter votre contribution pour améliorer cette application !
